//==========================================================
// BlockA.cpp
// Auther : 桜井 博之
// Data   : 2002/01/14
//==========================================================

#include "BlockA.h"

//------------------------------------------------------
//	Name:	CBlockA
//	Func:	コンストラクタ
//	in:		LPDIRECT3DDEVICE8 d3dDevice = D3Dデバイス
//	Out:	なし
//------------------------------------------------------
CBlockA::CBlockA(LPDIRECT3DDEVICE8 d3dDevice)
		:CStageObj(d3dDevice)
{

}

//----------------------------------------------
//	Name:	~CBlockA
//	Func:	デストラクタ
//	in:		なし
//	Out:	なし
//----------------------------------------------
CBlockA::~CBlockA()
{

}

//----------------------------------------------
//	Name:	FrameMove
//	Func:	毎フレームの処理
//	in:		なし
//	Out:	なし
//----------------------------------------------
void CBlockA::FrameMove()
{

}

//----------------------------------------------
//	Name:	Render
//	Func:	画面描画
//	in:		なし
//	Out:	なし
//----------------------------------------------
void CBlockA::Render()
{
	/* ワールド変換 */
	m_pd3dDevice->SetTransform( D3DTS_WORLD, &m_matStock);
	
	/* 描画 */
	CStageObj::Render();
}